Repository: lf-j/OpenSourceComplianceHandbook-Translation
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: ja

source: Review and approve proposals to release proprietary source code under an open source license.
ja: プロプラエタリなコードをオープンソース ライセンス下でリリースする提案をレビューし承認

source: Review and approve updates to end-user documentation
ja: エンドユーザー向け文書のアップデートをレビューし承認

source: Review and approve updates to end-user documentation This form of legal support is related to ensuring that appropriate open source notices (copyright, attributions, and license notices) are provided to consumers in relation to any open source included in the product.
ja: エンドユーザー向け文書のアップデートをレビューし承認 こうした法務上のサポートは、製品に含まれるすべてのオープンソースについて、適切なオープンソースの告知 (著作権、帰属、ライセンス告知)を確実に消費者に提供するために行います。

source: Review and approve usage, modification, distribution of open source (OS) software
ja: オープンソース ソフトウェアの利用、改変、配布をレビューし承認

source: Review end-user documentation to ensure that appropriate copyright, attribution, and license notices are given to consumers regarding open source included in the product or the software stack.
ja: エンドユーザー向け文書をレビューし、製品やソフトウェアスタックに含まれるオープンソースについて、消費者へのコピーライト、帰属、ライセンスの告知が適切であることを確認します。

source: Review phase outcome
ja: レビュー フェーズの結果

source: Review phase outcome OSRB members perform an architecture review and a linkage analysis for the specific component and mark it as ready for the next step (i.e., Approval) if no issues are uncovered.
ja: レビュー フェーズの結果 OSRBメンバーは、特定のコンポーネントに対してアーキテクチャ レビューとリンク解析を実施し、もし課題が発見されなければ、次のステップ（つまり承認）への準備が整っているという印をつけます。

source: Review phase prerequisite
ja: レビュー フェーズの前提条件

source: Review requests for the use, modification, and distribution of open source: The OSRB reviews and approves incoming requests from engineering and product teams for using open source.
ja: オープンソースの利用、改変、配布の申請をレビューします。OSRBはエンジニアリングや製品部門からのオープンソース利用申請 をレビューし承認します。

source: Reviewers of the compliance ticket and their roles
ja: コンプライアンス チケットのレビュアーとその役割

source: Reviews
ja: レビュー

source: Reviews Once the auditing is complete and all issues identified earlier have been resolved, the compliance ticket for a specific software component moves to the review step.
ja: レビュー 監査が完了し、以前に特定された全ての課題が解決されたら、特定のソフトウェア コンポーネントに対するコンプライアンス チケットは、レビュー ステップへ移動します。

source: Reviews 113
ja: レビュー 113

source: Reviews 70
ja: レビュー 70

source: Reviews may evaluate performance on whether employees:
ja: レビューは、従業員が以下の項目を実行したかを評価します。

source: Richard Lumb, Chief Executive, Financial Services, Accenture
ja: リチャード ラム, Chief Executive, 財務サービス, Accenture

source: Rob Alexander, CIO, Capital One
ja: ロブ アレキサンダー, CIO, Capital One

source: Rules Governing the OSRB Usage Form
ja: OSRB利用フォームに影響する規則

source: Rules Governing the OSRB Usage Form There are several rules governing the OSRB usage form.
ja: OSRB利用フォームに影響する規則 OSRB利用フォームに影響するいくつかの規則があります。

source: Rules Governing the OSRB Usage Form 99
ja: OSRB利用フォームに影響する規則 99

source: Rules to follow when integrating libraries and other middleware to avoid linkage issues that might arise
ja: リンクにより起き得る問題を回避するため、ライブラリやその他ミドルウェアを統合するときの規則

source: Run a source code scanning tool over the software base
ja: ソフトウェアベースに対しソースコードをスキャンするツールを適用

source: Run a source code scanning tool over the software base .
ja: ソフトウェアベースに対しソースコードをスキャンするツールを適用

source: SCALING OPEN SOURCE LEGAL SUPPORT
ja: オープン ソース法務サポートを拡大させる

source: SOFTWARE INTERACTION METHODS
ja: ソフトウェア相互作用法

source: SOFTWARE INTERACTION METHODS 143
ja: ソフトウェア相互作用法 143

source: SOURCE CODE DISTRIBUTION
ja: ソース コード頒布

source: SOURCE CODE DISTRIBUTION 100
ja: ソース コード頒布 100

source: SOURCE CODE MODIFICATION CONSIDERATIONS
ja: ソース コード変更に関する考察

source: SOURCE CODE MODIFICATION CONSIDERATIONS 128
ja: ソース コード変更に関する考察 128

source: SPECIFIC LICENSE OBLIGATIONS
ja: 特定のライセンス義務

source: SPECIFIC LICENSE OBLIGATIONS 133
ja: 特定のライセンス義務 133

source: SPONSORSHIP
ja: 後援者

source: STAFFING
ja: スタッフ割り当て

source: STAFFING Ensure that staff is allocated to the compliance function, and that adequate compliance training is provided to every employee in the organization.
ja: スタッフ割り当て スタッフがコンプライアンスの職務のために割り当てられ、十分なコンプライアンスの訓練が組織の全従業員に確実に施されていなければなりません。

source: SUPPLY CHAIN
ja: サプライチェーン

source: SUPPLY CHAIN Supply chain (software procurement) procedures must be updated to address the acquisition and use of open source.
ja: サプライチェーン サプライチェーン (ソフトウェアの調達) 部門 の手続きはオープンソースの取得や利用を書き下したものに更新しなければなりません。

source: SUPPLY CHAIN 59
ja: サプライチェーン 59

source: Sample compliance due-diligence process
ja: コンプライアンス精査プロセスの例

source: Sample dynamic linkage matrix
ja: 動的リンク マトリックス例

source: Sample process compliance failures
ja: コンプライアンス プロセス上の失敗の例

source: Sample process compliance failures Failure
ja: コンプライアンスプロセス上の失敗の例 失敗

source: Sample publication process
ja: 公開プロセスの例

source: Sample static linkage matrix
ja: 静的リンク マトリックスの例

source: Scan all incoming software received from third party software providers and ensure that their open source disclosures are correct and complete.
ja: サードパーティのソフトウェア プロバイダから受領するすべてのソフトウェアをスキャンし、オープンソースに関する開示が正しく、完全であることを確認します。

source: Scan all source code
ja: 全ソース コードスキャン

source: Scan every bit of source code incorporated into products and services, because development teams may have introduced open source into proprietary or third-party source code.
ja: 開発チームがオープン ソースをプロプライエタリ ソース コードやサード パーティ ソースコードに使用しているかもしれないので、製品やサービスに統合される全てのソース コードをスキャンします。

source: Scan newer versions of previously approved packages
ja: 前に承認されているパッケージの新しいバージョンのスキャン

source: Scanning source code early in the development process and continuing to do so regularly ensures that compliance efforts are not lagging behind the development efforts.
ja: 開発プロセスにおいて早期にソースコードスキャンを行い、それを定常的に継続することは、コンプライアンスの取り組みが開発の取り組みに後れを取らないようにします。

source: Scenario 1: Source code is 100% proprietary
ja: シナリオ1：スキャンされたソース コードは、100%プロプライエタリである

source: Scenario 1: Source code is 100% proprietary The scanned software component contains 100% proprietary code, and no open source code is declared or identified.
ja: シナリオ1：スキャンされたソース コードは、100%プロプライエタリである スキャンされたソフトウェア コンポーネントは、100%プロプライエタリ コードだけを含んでいて、オープン ソース コードは申告も特定もされていない。

source: Scenario 1: The source code scanned is 100% proprietary
ja: シナリオ1：スキャンされたソース コードは100%プロプライエタリである

source: Scenario 1: The source code scanned is 100% proprietary Scenario 2: The source code scanned includes code with incompatible licenses Scenario 3: Issue with linkages identified during architectural review
ja: シナリオ1：スキャンされたソース コードは100%プロプライエタリである シナリオ2：スキャンされたソース コードは両立しないライセンスを含むコードを含んでいる シナリオ3：リンクに関する課題がアーキテクチャー レビューの最中に特定される

source: Scenario 2: Incompatible licenses
ja: シナリオ2：両立性のないライセンス（の組み合わせ）

source: Scenario 2: Incompatible licenses The scanned software component includes source code that originated from multiple sources with incompatible licenses.
ja: シナリオ2：両立性のないライセンス（の組み合わせ） スキャンされたソフトウェア コンポーネントは、両立性のないライセンスが付けられた複数のソース コードに由来するソース コードを含んでいることがあります。

source: Scenario 2: The source code scanned includes code with incompatible licenses
ja: シナリオ2：スキャンされたソース コードは両立しないライセンスを含むコードを含んでいる

source: Scenario 3: Identified issue with linkages
ja: シナリオ3：リンクに関する課題が特定される

source: Scenario 3: Issue with linkages identified during architectural review
ja: シナリオ3：リンクに関する課題がアーキテクチャー レビューの最中に特定される

source: Scenario 4: A source code package is not used anymore
ja: シナリオ4：ソース コード パッケージはもはや使われていない

source: Scenario 4: A source code package is not used anymore Scenario 5: Due diligence identified IP that will be released to meet license obligations
ja: シナリオ4：ソース コード パッケージはもはや使われていない シナリオ5：精査でライセンス義務を満足する形でリリースするべきIPが特定される

source: Scenario 4: Source code no longer used
ja: シナリオ4：ソース コードは、もはや使われない

source: Scenario 4: Source code no longer used In this scenario, Engineering decides that a software component is not going to be included in the product while the software component is in transit through the compliance process.
ja: シナリオ4：ソース コードは、もはや使われない このシナリオでは、技術担当は、コンプライアンス プロセスの処理中に、そのソフトウェア コンポーネントが製品に混入しないようにします。

source: Scenario 5: Due diligence identified IP that will be released to meet license obligations
ja: シナリオ5：精査でライセンス義務を満足する形でリリースするべきIPが特定される

source: Scenario 5: IP at risk of requiring release
ja: シナリオ5：開示要求のリスクがあるIP

source: Scenario 5: IP at risk of requiring release In this scenario, legal review uncovered that closely-held intellectual property has been combined with an open source code package.
ja: シナリオ5：開示要求のリスクがあるIP このシナリオは、法務レビューが、非開示になっている知的財産とオープン ソース コード パッケージとが組み合わされていることを明らかにしたものです。

source: Scenario 6: Unresolved issue found
ja: シナリオ6：未解決の課題が見つかる

source: Scenario 6: Verification step has identified an issue that needs to be resolved
ja: シナリオ6：検証ステップで解決すべき課題が特定される

source: Scenario 7: Source code is approved
ja: シナリオ7：ソースコードは、承認される

source: Scenario 7: Source code is approved for use
ja: シナリオ7：ソース コードは利用が承認される

source: Scenario 7: Source code is approved for use Scenario 8: Source code is rejected
ja: シナリオ7：ソース コードは利用が承認される シナリオ8：ソース コードは利用が却下される

source: Scenario 8: Source code is rejected
ja: シナリオ8：ソース コードは利用が却下される

source: Secondly, you will be building up an expectation that future source code distributions will use this method as well.
ja: 第2に、将来のソース コード頒布でも同じ方法が取られるだろうという期待を築いてしまいます。

source: Several actions can trigger discovery and an audit for software components (Figure 12, next page):
ja: いくつかの活動が、ソフトウェア コンポーネントの発見と監査の契機となります。（図12、次ページ）

source: Several actions can trigger discovery and an audit for software components (Figure 12, next page): .
ja: いくつかの活動が、ソフトウェア コンポーネントの発見と監査の契機となります。（図12、次ページ）

source: Several challenges arise with incremental compliance.
ja: インクリメンタル コンプライアンスに関しては、解決すべきいくつかの課題が発生します。

source: Several companies received negative publicity .
ja: 企業は時として悪評

source: Several organizations have received negative publicity and/or have been subject to legal action after ignoring requests to provide compliance information; did not know how to handle compliance inquires; lacked or had a poor compliance program; or simply refused to cooperate, thinking (incorrectly) that license terms were not enforceable.
ja: コンプライアンス情報の提供要求を無視した後に、否定的な評判を受けたり、かつ／または、法的手続きを受けた組織、コンプライアンスに関する照会をどう扱えばよいかわからなかった組織、コンプライアンス プログラムを持っていなかったり整備していない組織、ライセンスが強制的でないと（誤って）考えて協力を単に拒む組織があります。

source: Shared header files
ja: 共有されているヘッダ ファイル

source: Shared header files .
ja: 共有されているヘッダ ファイル

source: Sign off on product distribution from an open source compliance perspective.
ja: 製品出荷をオープンソースコンプライアンスの観点から承認。

source: Similarly, looking at Table 10, source code licensed under License-A can statically link to source code license under License-C.
ja: 同様に、表10で、ライセンスAで許諾されたソース コードは、ライセンスCで許諾されたソース コードに静的にリンク可能です。

source: Simplified view of the compliance end-to-end process
ja: 一貫したコンプライアンス プロセスの簡略図

source: Since compliance is verified on a product-by-product, service-by-service basis, approving for use in one case does not necessarily serve for all cases.
ja: コンプライアンスは、製品ごと、サービスごとに確認されますので、一つのケースでの利用承認は、必ずしも全てのケースに適用されることにはなりません。

source: Since it is always a recommended practice to separate open source, company-developed proprietary software, and third party software in different folders in your build system, it becomes feasible to set up alerts when new code is being submitted.
ja: オープン ソースと自社開発プロプライエタリ ソフトウェアとサード パーティ ソフトウェアをビルド システムで別のフォルダーに分離しておくのは常に奨励されるプラクティスですから、新しいコードが提出された時に警告が出るようにすることはできます。

source: Since most of my experience was focused in the embedded space (with C and C++ being the dominant programming languages), this emphasis comes across throughout this handbook.
ja: ただ私の経験の大半が（CやC++が主要プログラミング言語である）組み込み領域中心だったため、本ハンドブックでは全般的にその傾向が色濃く出ている点についてはご留意いただければと思います。

source: Software Bill of Material (BOM) Difference Tools
ja: ソフトウェアBOM差分ツール

source: Software Bill of Material (BOM) Difference Tools 118
ja: ソフトウェアBOM差分ツール 118

source: Software category: OS/kernel, driver, middleware, library, utility, other (explain), etc.
ja: ソフトウェア カテゴリ：OS/kernel, driver, middleware, library, utility, other (explain), etc.

source: Software class: open source, internally developed, third- party shrink-wrap
ja: ソフトウェア区分：オープンソース、内製、サード パーティ パッケージ

source: Software class: open source, internally developed, third-party shrink-wrap
ja: ソフトウェア区分：オープンソース、内製、サード パーティ パッケージ

source: Software developers can use such a matrix as they merge incoming code from different projects under different licenses into a single body of code.
ja: ソフトウェア開発者は、異なるプロジェクトの異なるライセンスにあるコードをマージする際に、そのようなマトリックスを使うことができます。

source: Software developers need to be educated about the licenses on the various open source components they integrate and employ.
ja: ソフトウェア開発者は、統合し利用する様々なオープン ソース コンポーネントのライセンスに関しての教育を受ける必要があります。

source: Software interaction methods: A guide to understanding how software components available under different licenses interact, and if the method of interaction is allowed per company compliance policies
ja: ソフトウェア相互作用法：異なるライセンスで利用可能なソフトウェア コンポーネントがどのように相互作用するか、相互作用の方法は企業のコンプライアンス ポリシーで許可されているかを理解するガイド

source: Software interaction methods: A guide to understanding how software components available under different licenses interact, and if the method of interaction is allowed per company compliance policies .
ja: ソフトウェア相互作用法：異なるライセンスで利用可能なソフトウェア コンポーネントがどのように相互作用するか、相互作用の方法は企業のコンプライアンス ポリシーで許可されているかを理解するガイド

source: Software received from third-party vendors must be audited to identify any open source included, which will ensure license obligations can be fulfilled before product ships.
ja: サード パーティ企業から受け取るソフトウェアは、含まれているオープン ソースを全て特定しなければなりません。このことは、製品出荷前までにライセンス義務を実施することを確実にしてくれます。

source: Solid understanding of common open source licenses and obligations to discuss with legal counsel Knowledge of industry practices
ja: 法律顧問の業界慣行の知識と討議できる、一般的なオープンソース ラインセンスと義務について確たる理解

source: Solid understanding of common open source licenses and obligations to discuss with legal counsel Knowledge of industry practices .
ja: 法律顧問の業界慣行の知識と討議できる、一般的なオープンソースラインセンスと義務について確たる理解

source: Some companies elect a different approach .
ja: ある会社は別のアプローチを取りました。

source: Some companies flag certain licenses as “not allowed” .
ja: いくつかの企業では、特定のライセンスには「不許可」のフラグを付けます。

source: Some companies forget to go through a linguistic review and when/if their product is hacked, they face embarrassment from exposure of inappropriate comments left in the source code.
ja: ある企業では、リンギスティック レビューを通すことを忘れてしまい、製品がハックされた時に、ソース コード中に残っていた不適切なコメントが発覚し、困惑しました。

source: Some companies maintain both an internal and an external open source web portal.
ja: いくつかの企業は、社内向け、社外向けのオープン ソース ウェブ ポータルを運営しています。

source: Some companies opt for both options when possible, in addition to maintaining these notices on a given website (optional, but also often adopted, and it’s low maintenance - basically just hosting the notices file on the website).
ja: いくつかの企業は、ウェブサイト（一つの選択肢ではありますが、頻繁に採用され、維持にも手がかかりません。基本的にはウェブサイト上に通知ファイルを置くだけです。）上で通知を維持しながら、可能な時には両方の選択肢を選びます。

source: Some companies opt for both options when possible, in addition to maintaining these notices on a given website (optional, but also often adopted, and it’s low maintenance .
ja: いくつかの企業は、ウェブサイト（一つの選択肢ではありますが、頻繁に採用され、維持にも手がかかりません。基本的にはウェブサイト上に通知ファイルを置くだけです。）上で通知を維持しながら、可能な時には両方の選択肢を選びます。

source: Some companies use bug tracking tools (see list below) already in place with a customized compliance workflow; other companies rely on specific project management tools or even in-house solutions.
ja: いくつかの企業では、カスタマイズしたコンプライアンス ワークフローと共にバグ追跡ツールをすでに実際に利用しています。他の企業では、特定のプロジェクト管理ツールや自社開発ツールを利用しています。

source: Some linkage combination may be allowed on a case-by case basis, which is why certain combinations note “[Requires pre-approval].”
ja: いくつかのリンクの組み合わせは、ケース バイ ケースで許可されます。そのため、「事前承認必要」と注意が書かれています。

source: Some open source licenses explicitly require author attribution.
ja: いくつかのオープン ソース ライセンスは、明示的に著者の帰属を要求します。

source: Some organizations prefer to have a written request, sent to a corporate email address or a postal address (specified in the written offer), the result of which is that the client receives a copy of the source code, after the verification of their eligibility.
ja: ある組織は、企業窓口emailや郵便アドレス(書面による通知に書かれている)に対して書面で要求が送られるのを好みます。結果として、顧客は、入手資格を確認された後で、ソース コードのコピーを受け取ります。

source: Some recommended practices in this area include:
ja: この分野のいくつかの推奨プラクティスには以下のものがあります。

source: Some team members may be overwhelmed by the amount of work needed to implement such a complete program.
ja: プログラムのすべてを実装するのに必要な作業の多さに圧倒される関係者もいるかもしれません。

source: Sometimes a previously approved package is either modified and used again (in the same or in a different context) or used as-is or with modifications in a different product or service, or a new version is downloaded and applied in the software stack.
ja: ある場合には、前に承認されているパッケージが変更されて（同じ条件や異なる条件で）再利用されたり、そのまま再利用されたり、変更されて異なる製品やサービスに再利用されたり、新しいバージョンがダウンロードされてソフトウェア スタックに使用されたりします。

source: Source Code Auditing
ja: ソース コード監査

source: Source Code Auditing There are three core recommended practices for source code auditing or scanning:
ja: ソース コード監査 ソース コード監査やスキャンに関して、3つの推奨プラクティスがあります。

source: Source Code Auditing 111
ja: ソース コード監査 111

source: Source Code Comments
ja: ソース コード コメント

source: Source Code Identification Tools
ja: ソース コード特定ツール

source: Source Code Identification Tools Source code and license identification tools provide recognition and analysis capabilities to assist users in identifying the origin of source code and licenses associated with open source software components.
ja: ソース コード特定ツール ソース コードとライセンスを特定するツールは、ユーザーがオープン ソース ソフトウェア コンポーネントに関連するソース コードとライセンスの由来を特定するのを助けるような、検出と解析の機能を提供します

source: Source Code Identification Tools 117
ja: ソース コード特定ツール 117

source: Source Code Modifications Markup
ja: ソース コード変更の印

source: Source Code Scan
ja: ソース コード スキャン

source: Source Code Scan 79
ja: ソース コード スキャン 79

source: Source Code Scan Phase
ja: ソース コード スキャン段階

source: Source Code Scan Phase 84
ja: ソース コード スキャン フェーズ 84

source: Source code and license identification tools provide recognition and analysis capabilities to assist users in identifying the origin of source code and licenses associated with open source software components.
ja: ソース コードとライセンスを特定するツールは、ユーザーがオープン ソース ソフトウェア コンポーネントに関連するソース コードとライセンスの由来を特定するのを助けるような、検出と解析の機能を提供します。

source: Source code available under these licenses may be pre-approved for use by developers without having to go through the approval process with their manager and/ or legal counsel.
ja: これらのライセンスで許諾されたソース コードは、開発者が、マネージャや法務担当への承認プロセスを通すことなく、利用が事前承認されています。

source: Source code available under these licenses may be pre-approved for use by developers without having to go through the approval process with their manager and/or legal counsel.
ja: これらのライセンスで許諾されたソース コードは、開発者が、マネージャや法務担当への承認プロセスを通すことなく、利用が事前承認されています。

source: Source code available under these licenses requires legal review and approval.
ja: これらのライセンスで許諾されたソース コードは、法務によるレビューを承認を必要とします。

source: Source code changes in a previously approved component .
ja: 以前に承認されたコンポーネントでのソース コード変更

source: Source code downloaded from the web (unknown author or license)
ja: ウェブからダウンロードされたソース コード（著者やライセンスが不明）

source: Source code downloaded from the web (unknown author or license) .
ja: ウェブからダウンロードされたソース コード（著者やライセンスが不明）

source: Source code downloaded from the web with unknown author and/ or license, which may or may not have incorporated open source in it .
ja: 作者やライセンスが不明であり、オープン ソースが含まれているかもしれないウェブからダウンロードしたソース コード。

source: Source code downloaded from the web with unknown author and/or license, which may or may not have incorporated open source in it
ja: 作者やライセンスが不明であり、オープン ソースが含まれているかもしれないウェブからダウンロードしたソース コード。

source: Source code downloaded from the web with unknown author and/or license, which may or may not have incorporated open source in it .
ja: 作者やライセンスが不明であり、オープン ソースが含まれているかもしれないウェブからダウンロードしたソース コード。

source: Source code has been audited and all issues have been resolved.
ja: 監査されたソース コード、解決されている全ての課題。

source: Source code matches pending identification
ja: 特定保留中のソース コード一致

source: Source code modifications that will remain proprietary must not be made within an open source package, especially one that has derivative work obligations (e.g., GPL or LGPL).
ja: プロプライエタリを残すソース コード変更は、特に派生物への義務を持つような（GPL, LGPL等の）オープン ソース パッケージ内で行っていはいけません。

source: Source code packages (including modifications) have been verified to match the binary equivalent shipping in the product
ja: ソース コード パッケージ（変更を含む）は、製品として出荷されるバイナリと一致することが確認されている。

source: Source code packages (including modifications) have been verified to match the binary equivalent shipping in the product .
ja: ソース コード パッケージ（変更を含む）は、製品として出荷されるバイナリと一致することが確認されている。

source: Source code packages can be compiled and built on an external computer without errors.
ja: ソース コード パッケージは、外部コンピュータでエラー無しにコンパイルとビルドができます。

source: Source code packages can be uncompressed on an external computer without errors.
ja: ソース コード パッケージは、外部コンピュータでエラー無しに圧縮解凍できます。

source: Source code packages have been prepared and tested to compile on a standard development machine.
ja: ソース コード パッケージは、準備され、標準開発マシン上でコンパイルできるかテストされます。

source: Source code packages have been successfully uploaded to the website and can be downloaded on an external computer.
ja: ソース コード パッケージは、ウェブサイトに問題なくアップロードされ、外部コンピュータからダウンロード可能になっています。

source: Source code packages made available (including modifications) match the binary(ies) shipping in the product or software stack
ja: ソース コード パッケージ（変更分も含めて）は、製品やソフトウェア スタックに入って出荷されるバイナリと一致するものが、入手可能にされる。

source: Source code packages made available (including modifications) match the binary(ies) shipping in the product or software stack .
ja: ソース コード パッケージ（変更分も含めて）は、製品やソフトウェア スタックに入って出荷されるバイナリと一致するものが、入手可能にされる。

source: Source code provided is complete and corresponds to the binaries in the product.
ja: 提供されるソース コードは、完結しており、製品に搭載されるバイナリと一致します。

source: Source code received from a third-party software provider who may or may not have disclosed open source
ja: オープン ソースを開示しているかわからないサード パーティ ソフトウェア プロバイダーから受け取ったソース コード。

source: Source code received from a third-party software provider who may or may not have disclosed open source .
ja: オープン ソースを開示しているか不明なサード パーティ ソフトウェア プロバイダーから受け取ったソース コード。

source: Source code scanning and license identification tools
ja: ソース コード スキャンとライセンス特定ツール

source: Source code scanning and license identification tools .
ja: ソース コード スキャンとライセンス特定ツール.

source: Source code scanning or auditing personnel
ja: ソース コード スキャンか監査の担当者

source: Source code, including modifications (when applicable), has been prepared and is available at the time the product ships .
ja: 変更（適用可能な場合）を含むソース コードは準備されて、製品出荷の時点で入手可能になっている。

source: Specific compliance scenarios
ja: コンプライアンス シナリオの一例

source: Specific engineering situations that are applicable to open source compliance
ja: オープンソース コンプライアンスに関わり得るエンジニアリング上の特別な状況

source: Specifically, you must correctly identify the source code that changed between version 1.0 and version 1.1, and verify compliance on the delta between the releases:
ja: 特に、V1.0とV1.1の間で変更されたソース コードを正確に把握し、リリースの間の変化点についてコンプライアンスを検証します。

source: Specifically, you must correctly identify the source code that changed between version 1.0 and version 1.1, and verify compliance on the delta between the releases: .
ja: 特に、V1.0とV1.1の間で変更されたソース コードを正確に把握し、リリースの間の変化点についてコンプライアンスを検証します。

source: Speed innovation, since the organization is able to safely adopt open source components and use them as enablers for new services and products
ja: 組織は安全にオープン ソース コンポーネントを採用して、新しいサービスや製品の立ち上げに必須のものとして利用できるので、イノベーションを加速できます。

source: Step 1 .
ja: ステップ1

source: Step 10 .
ja: ステップ10

source: Step 2 .
ja: ステップ 2 .

source: Step 3 .
ja: ステップ3

source: Step 4 .
ja: ステップ4

source: Step 5 .
ja: ステップ5

source: Step 6 .
ja: ステップ6

source: Step 7 .
ja: ステップ7

source: Step 8 .
ja: ステップ8.

source: Step 9 .
ja: ステップ9

source: Steps accomplished after the OSRB approval
ja: OSRB承認後に実施されるステップ
